Repository: 84000/translation-memory-resources
Catalog: post_input/toh94-C.bo.en.tmx
Source language: bo
Languages: en

source: དེ་སྐད་ ཅེས་ བཀའ་ སྩལ་ ནས །_ |#| བྱང་ཆུབ་ སེམས་དཔའ་ མཆོག་ ཏུ་ དགའ་བ འི་ རྒྱལ་པོས་ བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $1 When the Blessed One had spoken these words, the bodhisattva Prāmodyarāja once more addressed him:

source: བཅོམ་ལྡན་འདས་ ལེགས་ སོ་ ལེགས་ སོ །_།
en: “Excellent, O Blessed One, excellent.

source: བསྐལ་པ་ བཟང་པོ་པ འི་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱིས་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ དེ་དག་ གང་དང་གང་ དག་ ལ་ དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་པ་ དང་ །_ དགེ་བ འི་ རྩ་བ་ གང་དང་གང་ དག་ གིས་ དེ་བཞིན་ གཤེགས་པ་ དེ་དག་ ལ་ བཀུར་སྟི་ [288a] བགྱིས་ ནས |#| བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་པ་ དག་ ལུང་བསྟན་ དུ་ གསོལ །_
en: Now please make clear the identity of the blessed buddhas before whom these blessed buddhas of the Good Eon first gave rise to the mind of awakening. |#| Please also state the roots of virtue that allowed them to venerate those buddhas [288.a] and give rise to the mind of awakening.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ མཆོག་ ཏུ་ དགའ་བ འི་ རྒྱལ་པོ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: $2 In reply, the Blessed One spoke these words to the bodhisattva Prāmodyarāja:

source: མཆོག་ ཏུ་ དགའ་བ འི་ རྒྱལ་པོ་ དེ འི་ ཕྱིར་ ལེགས་པ ར་ རབ་ཏུ་ ཉོན་ ལ་ ཡིད་ ལ་ ཟུང་ ཤིག་ དང་ བཤད་ དོ །_།
en: “Prāmodyarāja, listen carefully and keep my words in mind; |#| I shall explain.”

source: བྱང་ཆུབ་ སེམས་དཔའ་ མཆོག་ ཏུ་ དགའ་བ འི་ རྒྱལ་པོས་ བཙུན་པ་ བཅོམ་ལྡན་འདས་ དེ་ལྟ་ ལེགས་ སོ་ ཞེས་ གསོལ་ ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ལྟར་ ཉན་པ་ དང་ །_
en: $3 “Respected Blessed One, so be it,” answered the bodhisattva Prāmodyarāja and he listened accordingly.

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: Then the Blessed One spoke:

source: དེ་བཞིན་ གཤེགས་པ་ འཁོར་བ་ འཇིག་ གིས་ ནི །_། དེ་བཞིན་ གཤེགས་པ་ མི་ ཡི་ ཟླ་ དེ་ ལ །_། གསེར་ ལས་ བྱས་པ འི་ གདུགས་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $4 “The thus-gone Krakucchanda |#| Offered golden parasols |#| To the thus-gone Moon of Humanity |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ གསེར་ཐུབ་ ཕྲེང་རྒྱུད་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སེང་གེ འི་ སྟབས་ དེ་ ལ །_། སྣ་མ འི་ མེ་ཏོག་ དག་ གི་ ཕྲེང་བ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $5 “The thus-gone Kanakamuni, when a garland maker, |#| Offered a garland of sumanā flowers |#| To the thus-gone Lion Gait |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འོད་སྲུང་ བྲམ་ཟེ འི་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཙམ་པ འི་ མཆོག་ དེ་ ལ །_། སྐ་རགས་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $6 “The well-gone Kāśyapa, when the son of a brahmin, |#| Offered a belt |#| To the thus-gone Supreme Campaka |#| And in doing so first gave rise to the mind of awakening.

source: ང་ ནི་ སྔོན་ཚེ་ སྨན་པ ར་ གྱུར་པ་ ན །_། |#| དེ་བཞིན་ གཤེགས་པ་ ཤཱཀྱ་ ཐུབ་ དེ་ ལ །_། འཇམས་ གང་ཞིག་ ནི་ དབུལ་བ ར་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $7 “When in the past I was a doctor |#| I offered a cup of rice gruel |#| To the thus-gone Śākyamuni |#| And in doing so first gave rise to the mind of awakening.

source: བྱང་ཆུབ་ སེམས་དཔའ་ བྱམས་པ་ འཁོར་ལོ ས་ སྒྱུར་བ་ ཡི །_། རྒྱལ་པོ་ རྣམ་པར་ སྣང་བྱེད་ ཅེས་ བྱར་ གྱུར་པ་ ན །_། |#| བདེ་གཤེགས་ མཐུ་ཆེན་ གདུགས་ཚོད་ དག་ ལ་ སྤྱན་ དྲངས་ ནས །_། |#| དང་པོ ར་ བླ་མེད་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $8 “The bodhisattva Maitreya, when the universal monarch named Illuminator, |#| Invited the well-gone Powerful |#| To the midday meal |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ སེང་གེ་ དག་ གིས་ ནི །_། དེ་བཞིན་ གཤེགས་པ་ ང་རོ་ སྙན་ དེ་ ལ །_། ཕྱག་དར་ ཁྲོད་ ཀྱི་ ལྷན་པ་ ཐལ་མོ་ ཙམ །_། ཕུལ་ ནས་ དང་པོ ར་ བྱང་ཆུབ་ སེམས་བསྐྱེད་ དོ །_།
en: $9 “The thus-gone Siṃha |#| Offered a refuse rag the size of a palm |#| To the thus-gone Melodious Roar |#| And in doing so first gave rise to the mind of unexcelled awakening.

source: བདེ་གཤེགས་ རབ་གསལ་ ཚོང་པ ར་ གྱུར་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མཐའ་ ཡ ས་ འོད་ དེ་ ལ །_། ནོར་བུ་ རིན་པོ་ཆེ་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $10 “The well-gone Pradyota, when a merchant, |#| Offered a precious jewel |#| To the thus-gone Infinite Light |#| And in doing so first gave rise to the mind of unexcelled awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཐུབ་པ་ དག་ གིས་ ནི །_། དེ་བཞིན་ གཤེགས་པ་ ཡིད་ འཐད་ གཟིགས་ དེ་ ལ །_། མུ་ཏིག་ དག་ [288b] ལས་ བྱས་པ འི་ གདུགས་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $11 “The thus-gone Muni |#| Offered a parasol made of pearls [288.b] |#| To the thus-gone Compelling Vision |#| And in doing so first gave rise to the mind of unexcelled awakening.

source: བདེ་གཤེགས་ མེ་ཏོག་ གྲོང་ཁྱེར་ རྟེན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཁ་ལོ་ སྒྱུར་ དེ་ ལ །_། ལ་དུ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $12 “The well-gone Kusuma, while a city beggar, |#| Offered laḍḍu sweets |#| To the thus-gone Leader |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ མེ་ཏོག་ གཉིས་པ་ ཡིས །_། བདེ་གཤེགས་ མངོན་པར་ འཕགས་པ འི་ དཔལ་ དེ་ ལ །_། ཚེམས་ཤིང་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $13 “The second thus-gone with the name of Kusuma |#| Offered toothsticks |#| To the well-gone Truly Superior Glory |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ སྤྱན་ ལེགས་ ཁྱིམ་བདག་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ལེགས་པ ར་ སྒྲ་ སྒྲོགས་ ལ །_། ཁང་པ་ བརྩེགས་པ་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $14 “The thus-gone Sunetra, when a householder, |#| Offered a multistoried mansion |#| To the thus-gone Excellent Speaker |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དེད་དཔོན་ དག་ གིས་ ནི །_། དེ་བཞིན་ གཤེགས་པ་ བདེན་པ་ མཐོང་ དེ་ ལ །_། ཙན་དན་ དམར་པོ འི་ ཁྲིའུ་ དག་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $15 “The thus-gone Sārthavāha |#| Offered seats of red sandalwood |#| To the thus-gone Seeing the Truth |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ལག་ ཆེན་ རོལ་མོ་ མཁན་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མཆོག་ གྲགས་ གྲོང་ཁྱེར་ དུ །_། བདེ་གཤེགས་ དེ་ ལ་ གླིང་བུ ས་ མཆོད་ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $16 “The well-gone Mahābāhu, when a musician, |#| Offered a flute in the city |#| To the thus-gone Supreme Fame |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྟོབས་ཆེན་ སྤོས་ འཚོང་ བུར་ གྱུར་ ཚེ །_། བདེ་གཤེགས་ སེང་ བློ་ གྲོང་ཁྱེར་ གཤེགས་པ་ ན །_། |#| ཨ་ ག་ རུ་ ཡི་ རྡོག་མ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $17 “The well-gone Mahābala, when the son of an incense merchant, |#| Offered a piece of aloeswood |#| When the well-gone Lion Mind was entering the city |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རྒྱུ་སྐར་ རྒྱལ་པོ་ ཕྱུགས་རྫི འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དབྱངས་ བྱིན་ དེ་ |#| ལ་ ནི །_། ཁ་ ལ འི་ མེ་ཏོག་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $18 “The well-gone Nakṣatrarāja, when a cattle herder, |#| Offered tāmbūla flowers |#| To the thus-gone Melody Gift |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རྩི་སྨན་ ཤིང་རྟ་ མཁན་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དྲི་ཞིམ་ དེ་ ལ་ ནི །_། ཏིང་ལོ་ མར་མེ་ བཅས་པ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $19 “The well-gone Oṣadhi, when a chariot maker, |#| Offered a small lamp |#| To the thus-gone Sweet Fragrance |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྙན་པ་ ཐ་ག་པ ར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མར་མེ འི་ གློག་ འགྱུ་ ལ །_། རས་ ཀྱི་ ཁ་ཚར་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $20 “The well-gone Yaśas,#155 when a weaver, |#| Offered woven tassels |#| To the thus-gone Flashing Lamp |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་ ཏོག་ ཞིང་པ ར་ གྱུར་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ པད་མོ འི་ འོད་ཟེར་ ལ །_། མེ་ཏོག་སིལ་མ་ དག་ གིས་ གཏོར་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $21 “The thus-gone Ketu, when a farmer, |#| Scattered flower petals |#| Before the thus-gone Radiant Lotus |#| And in doing so first gave rise to the mind of awakening. [289.a]

source: བདེ་ [289a] གཤེགས་ འོད་ ཆེན་ གྲོང་ཁྱེར་ རྟེན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྒྲོན་མ་ ཆེན་པོ་ སྟེ །_། |#| དྲང་སྲོང་ དེ་ ལ་མ ར་ མེ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $22 “The well-gone Mahāprabha, when a city beggar, |#| Offered a lamp |#| To the sage, the thus-gone Great Lamp, |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གྲོལ་ ཕུང་ ལྷམ་ མཁན་ གྱུར་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཚངས་པ འི་ དབྱངས་ དེ་ ལ །_། མཆིལ་ལྷམ་ ཟུང་ ཅིག་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $23 “The well-gone Muktiskandha, when a cobbler, |#| Offered a set of footwear |#| To the thus-gone Brahmā Melody |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རྣམ་སྣང་ འཁོར་ལོ ས་ སྒྱུར་བ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡིད་གཉིས་ འཇོམས་ དེ་ ལ །_། ཏ་ ལི་བ་ ཏི་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $24 “The well-gone Vairocana, when a universal monarch, |#| Offered eighty-four thousand talibati#156 |#| To the thus-gone Destroyer of Doubt |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཉི་ སྙིང་ བྲམ་ཟེ འི་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གཟི་བརྗིད་ མཐའ་ ཡས་ལ །_། ཀོ་ཤ་ ཏ་ ཀ འི་ མེ་ཏོག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $25 “The well-gone Sūryagarbha, when a brahmin boy, |#| Offered kośātaka flowers |#| To the thus-gone Infinite Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཟླ་བ་ གསེར་མགར་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ འི་ ཞལ་ དེ་ ལ །_། རིན་པོ་ཆེ་ ཡི་ སྡོང་བུ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $26 “The well-gone Candra, when a goldsmith’s son, |#| Offered a jeweled staff |#| To the thus-gone Moon Face |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འོད་འཕྲོ་ གྲོང་ཁྱེར་ རྟེན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མཐའ་ ཡ ས་ འོད་ དེ་ ལ །_། རྩྭ་ ཡི་ སྒྲོན་མ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $27 “The well-gone Arciṣmat, when a city beggar, |#| Offered grass torches |#| To the thus-gone Infinite Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འོད་ བཟངས་ ནགས་ཚལ་ སྲུང་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡིད་འོང་ གཟི་བརྗིད་ ལ །_། ཙམ་པ་ཀ་ ཡི་ མེ་ཏོག་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $28 “The well-gone Suprabha, when guarding a forest, |#| Offered campaka flowers |#| To the thus-gone Delightful Splendor |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མྱ་ངན་མེད་པ་ ཚོང་དཔོན་ བུས །_། |#| དེ་བཞིན་ གཤེགས་པ་ ཡིད་གཉིས་ རྣམ་ འཇིག་ ལ །_། ཀ ར་ ནི་ ཀ་ ཡི་ མེ་ཏོག་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $29 “The well-gone Aśoka, when the son of a merchant, |#| Offered karṇikā flowers |#| To the thus-gone Destroyer of Doubt |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྐར་རྒྱལ་ ཁྱིམ་བདག་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བསོད་ནམས་ སྒྲོན་ དེ་ ལ །_། ནོར་བུ་ རིན་ཆེན་ མཆིལ་ལྷམ་ ཟུང་ ཅིག་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $30 “The well-gone Tiṣya, when the son of a householder, |#| Offered a pair of jeweled footwear |#| To the thus-gone Merit Lamp |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རབ་གསལ་ རྒྱ་མཚོ འི་ ཚོང་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ལེགས་པ ར་ མཐོང་ དེ་ |#| ལ །_། ཙན་དན་ དམར་པོ འི་ གཟིམས་ ཁྲི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $31 “The well-gone Pradyota, when a seafaring merchant, |#| Offered a bed made of red sandalwood |#| To the thus-gone Excellent Sight |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཕྲེང་ཐོགས་ ཁྱིམ་བདག་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡིད་ [289b] འོང་ གཟི་བརྗིད་ ལ །_། ཀ་ ཀ་ ནི་ ཡ འི་ བདུག་སྤོས་ གསོལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $32 “The well-gone Mālādhārin, when the son of a householder, [289.b] |#| Offered kakaniya incense |#| To the thus-gone Delightful Splendor |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡོན་ཏན་ འོད་ ནི་ གསེར་ རྟོག་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མཚུངས་པ་ མེད་ དེ་ ལ །_། མེ་ཏོག་ གཅིག་ཅིག་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $33 “The well-gone Guṇaprabha, when a gold dealer,#157 |#| Offered a single flower |#| To the thus-gone Incomparable |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དོན་ གཟིགས་ འཁོར་ལོ ས་ སྒྱུར་ རྒྱལ་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ འོད་ དཔག་མེད་ མཛོད་ ལ །_། ཁང་པ་ བརྩེགས་པ་ སྟོང་ སྙེད་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $34 “The well-gone Arthadarśin, when a universal monarch, |#| Offered a thousand multistoried houses |#| To the thus-gone Treasury of Infinite Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མར་མེ་ སྤོས་ འབྲུ་མར་ འཚོངས་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རྣམ་པར་ རོལ་པ ར་ སྣང་བ་ གང་ །_། བྱེ་བ་ དྲུག་ཅུ འི་ འཁོར་བཅས་ དག་ ལ་ ཁྲུས་ཁང་ གཅིག _། ཕུལ་ ནས་ |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $35 “The well-gone Pradīpa, when the son of a dealer in fragrant oils, |#| Offered a bathhouse with sixty million attendants |#| To the thus-gone Playful Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཐུ་ལྡན་ གོས་ འཚོང་ གྱུར་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གྲགས་པ་ རྒྱས་ དེ་ |#| ལ །_། རས་ བཅོས་ ལེབ་ལེབ་ ཕོ་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $36 “The well-gone Prabhūta, when a garment merchant, |#| Offered rolls of fine cloth#158 |#| To the thus-gone Expansive Fame |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྨན་པ་ སྨན་པ འི་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རྒྱལ་མཚན་ བྲལ་ དེ་ |#| ལ །_། སྤོས་ ཀྱི་ རི་ལུ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $37 “The well-gone Vaidya, when a physician’s son, |#| Offered small balls of incense |#| To the thus-gone Without Banner |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དེས་པ་ འབྲུ་མར་ མཁན་ གྱི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ འཕགས་ འཇོམས་ མཛད་ དེ་ ལ །_། མར་མེ་ ཁ་ཅིག་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $38 “The well-gone Sūrata, when an oil producer, |#| Offered a lamp |#| To the thus-gone Superior Conqueror |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཛོད་སྤུ་ ཕྲེང་རྒྱུད་ མཁན་ གྱི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ཏུ་ གཟིགས་ དེ་ |#| ལ །_། ཨུད་ པལ་ དམར་པོ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $39 “The well-gone Ūrṇa, when a garland maker, |#| Offered red utpalas |#| To the thus-gone Universal Vision |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བརྟན་ལྡན་ སྟོབས་ ཀྱི་ འཁོར་ལོ ས་ སྒྱུར་བ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གཞན་ གྱིས་ མི་ ཐུབ་ དེ་ |#| ལ་ ནི །_། རིན་པོ་ཆེ་ ལས་ བྱས་པ འི་ གདན་ཁྲི་ གྲངས་ བརྒྱད་ཅུ །_། རྩ་ བཞི་ ཕུལ་ ནས་ |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $40 “The well-gone Dṛḍha, when a universal monarch of strength, |#| Offered eighty-four jewel-studded seats |#| To the thus-gone Indomitable |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ལྷ་ དཔལ་ རྒྱ་མཚོ འི་ ཚོང་པ ར་ གྱུར་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གཟི་བརྗིད་ ཕུང་པོ འི་ འོད་ དེ་ ལ །_། ནོར་བུ་ རིན་ཆེན་ བླ་རེ་ དཔག་ཚད་ གཅིག་ སྣང་བ །_། ཕུལ་ ནས་ |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $41 “The well-gone Śrīdeva, when a seafaring merchant, |#| Offered a canopy of precious jewels that shone for one league |#| To the thus-gone Radiant Mass of Splendor |#| And in doing so first gave rise to the mind of awakening. [290.a]

source: བདེ་ [290a] གཤེགས་ གདུལ་ དཀའ་ ཤིང་ འཚོང་ གྱུར་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བརྟན་པ ར་ གཤེགས་ དེ་ |#| ལ །_། ཚེམས་ཤིང་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $42 “The well-gone Duṣpradharṣa, when a timber merchant, |#| Offered toothsticks |#| To the thus-gone Steadfast Movement |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ རྒྱལ་མཚན་ ཆུ འི །_། སྦྱིན་བདག་ གྱུར་ ཚེ་ བདེ་གཤེགས་ ཡིད་འོང་ གྲགས །_། |#| དེ་ ལ་ ཆུ་སྣོད་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $43 “The thus-gone Guṇadhvaja, when a water donor, |#| Offered water containers |#| To the well-gone Delightful Fame |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྒྲ་གཅན་ ཕྲེང་རྒྱུད་ མཁན་ བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མཐའ་ ཡ ས་ གཟུགས་ དེ་ ལ །_། གསེར་ གྱི་ མཆིལ་ལྷམ་ ཟུང་ ཅིག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $44 “The well-gone Rāhu, when a garland maker’s son, |#| Offered a set of golden footwear |#| To the thus-gone Infinite Form |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཚོགས་ཅན་ ཁྲུས་ པར་ གྱུར་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཐུགས་ རབ་ དང་བ་ ལ །_། ཁྲུས་ ཀྱི་ ཆལ་ དག་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $45 “The well-gone Gaṇin, when a bath attendant, |#| Offered bathing soap |#| To the thus-gone Lucid Heart |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཚངས་དབྱངས་ ཕྱུགས་རྫི ར་ གྱུར་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དབྱངས་སྙན་ དང་པོ ར་ མངོན་ རྫོགས་པ ར །_། སངས་རྒྱས་ གྱུར་པ འི་ ཚེ་ ན་ དེ་ ལ་ ཕྱེ་ བྲེ་ གང་ །_། ཕུལ་ ནས་ |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $46 “The thus-gone Brahmaghoṣa, when a cattle herder, |#| Offered a full measure of flour |#| To the thus-gone Beautiful Melody upon his awakening, |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཚིགས་ བརྟན་ འགྲོན་བུ་ འཚོང་བ འི་ བུར །_། གྱུར་ ཚེ་ བདེ་གཤེགས་ མི་ གཡོར་ གཤེགས་པ་ ལ །_། འགྲོན་བུ་ སྤར་གང་ གཏོར་ དེ་ |#| ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $47 “The well-gone Dṛḍhasaṃdhi, when a cowrie-shell merchant’s son, |#| Offered a handful of cowries |#| To the well-gone Gone Immutably upon his awakening, |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མི་ འགྱིང་ རྒྱལ་བུ་ དགའ་ འདོད་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བཀོད་པ་ མཐའ་ ཡས་ལ །_། གླུ་དབྱངས་ དག་ གིས་ མཆོད་པ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $48 “The well-gone Anunnata, when he was prince Joy Wish, |#| Offered songs and music |#| To the thus-gone Infinite Array |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འོད་ མཛད་ འཁོར་ལོ་ སྒྱུར་ རྒྱལ་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གཟི་བརྗིད་ བརྩེགས་ འོད་ ལ །_། ན་བཟའ་ རིན་པོ་ཆེ་ དག་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $49 “The well-gone Prabhaṃkara, when a universal monarch, |#| Offered precious garments |#| To the thus-gone Light of Compiled Splendor |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ་ ཆེན་པོ་ ཡིས །_། དེ་བཞིན་ གཤེགས་པ་ བློ་ གནས་ དེ་ ལ་ ནི །_། མེ་ཏོག་ མྱ་ངན་ འཚང་བ་ བདུན་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $50 “The thus-gone Mahāmeru |#| Offered seven aśoka flowers |#| To the thus-gone Abiding Mind |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རྡོ་རྗེ་ ལྷ་དབང་ བརྒྱ་བྱིན་ དུ །_། གྱུར་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ བརྟན་པ་ ལ །_། མེ་ཏོག་ མན་ དཱ་ ར་བ འི་ ཆར་ ཕབ་ ནས །_། |#| [290b] དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $51 “The well-gone Vajra, when born as Śakra, ruler of the gods, |#| Offered a shower of mandārava flowers |#| To the thus-gone Steadfast[290.b] |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ སྡོམ་ ཅན་ འཛམ་གླིང་ གི །_། རྒྱལ་པོ ར་ གྱུར་ ཚེ་ བདེ་གཤེགས་ ཐར་ དགྱེས་ ལ །_། གསེར་ ལས་ བྱས་པ འི་ བླ་རེ་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $52 “The thus-gone Sañjayin, when king of Jambudvīpa, |#| Offered a golden canopy |#| To the well-gone Delighting in Liberation |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མི་ བསྙེངས་ རོལ་མོ་ མཁན་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མི་ འཇིགས་ སྦྱིན་ དེ་ |#| ལ །_། རོལ་མོ འི་ བཀུར་སྟི ས་ རྔ་ཆེན་ བརྡུངས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $53 “The well-gone Nirbhaya, when a musician, |#| Offered musical veneration by beating big drums |#| To the thus-gone Giver of Fearlessness |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རིན་ཆེན་ བློ་ མཆོག་གྱུར་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བདུད་རྩི་ མཛོད་ དེ་ ལ །_། སྤོས་ ཀྱིས་ བསྒོས་པ འི་ ཕྲེང་བ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $54 “The well-gone Ratna, when a chief minister, |#| Offered a garland saturated with incense |#| To the thus-gone Nectar Maker |#| And in doing so first gave rise to the mind of awakening.

source: !བདེ་གཤེགས་ པད་ ལྡན་ འཁྲུལ་ འཁོར་ མཁན་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ཏུ་ གཟིགས་ དེ་ |#| ལ །_། ཁྲིའུ་ བཟངས་ གཅིག་ཅིག་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $55 “The well-gone Padmākṣa, when a maker of devices, |#| Offered a fine throne |#| To the thus-gone Universal Vision |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྟོབས་ བདེ་ རྒྱལ་པོ འི་ སྨན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བཞོན་པ་ ཆེ་ ལྡན་ ལ །_། སྐྱུ་རུ་ར་ ཡི་ འབྲས་བུ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $56 “The well-gone Balasena, when a royal physician, |#| Offered a myrobalan fruit |#| To the thus-gone Possessor of the Great Carriage |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མེ་ཏོག་ འོད་ཟེར་ གསེར་མགར་ གྱི །_། བུར་ གྱུར་ ཚེ་ ན་ བདེ་གཤེགས་ ཀུན་གཟིགས་ ལ །_། རིན་པོ་ཆེ་ ཡི་ ཕྲེང་བ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $57 “The well-gone Kusumaraśmi, when the son of a goldsmith, |#| Offered a garland of jewels |#| To the well-gone Universal Vision |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཤེས་ དགྱེས་ བྱིས་པ འི་ རྒྱན་ བྱེད་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡུལ་ཕྱོགས་ ཀུན་ མཆོད་ ལ །_། མིག་ དང་ བདུག་པ་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $58 “The well-gone Jñānapriya, when a maker of ornaments for children, |#| Offered flowers and incense#159 |#| To the thus-gone Worshiped in All Lands |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གཟི་ ཆེན་ ཚོང་དཔོན་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ འོད་ རབ་ དཔལ་ དེ་ ལ །_། ན་བཟ འི་ བླ་རེ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $59 “The well-gone Mahātejas, when the son of a merchant, |#| Offered a canopy of fine fabrics |#| To the thus-gone Glorious Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཚངས་པ་ བག་ ཆོས་ མཁན་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྟོན་པ་ བླ་མ་ ལ །_། ཤ་ཁ་ར་ ཡི་ རི་ལུ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $60 “The well-gone Brahmā, when a cook, |#| Offered a ball of sugar |#| To the thus-gone Highest Teacher |#| And in doing so first gave rise to the mind of awakening.
